[
    "Why don't scientists trust atoms? Because they make up everything.",
    "Why did the scarecrow win an award? Because he was outstanding in his field.",
    "I'm reading a book on anti-gravity. It's impossible to put down!",
    "Did you hear about the mathematician whos afraid of negative numbers? He will stop at nothing to avoid them.",
    "Why do we never tell secrets on a farm? Because the potatoes have eyes and the corn has ears.",
    "Why was the math book sad? Because it had too many problems.",
    "What do you call fake spaghetti? An impasta.",
    "Why did the coffee file a police report? It got mugged.",
    "How does a penguin build its house? Igloos it together.",
    "Why did the tomato turn red? Because it saw the salad dressing.",
    "What do you call cheese that isn't yours? Nacho cheese.",
    "Why couldn't the bicycle stand up by itself? It was two-tired.",
    "What do you call a dinosaur with an extensive vocabulary? A thesaurus.",
    "Whats orange and sounds like a parrot? A carrot.",
    "Why don't skeletons fight each other? They don't have the guts.",
    "What did the left eye say to the right eye? Between us, something smells.",
    "Why couldn't the leopard play hide and seek? Because he was always spotted.",
    "What do you call a fish wearing a crown? A king fish.",
    "Why did the student eat his homework? Because the teacher told him it was a piece of cake.",
    "What do you get when you cross a snowman and a vampire? Frostbite.",
    "How do you organize a space party? You planet.",
    "Why are ghosts bad liars? Because they are too transparent.",
    "What do you call an alligator in a vest? An investigator.",
    "Why don't eggs tell jokes? They'd crack each other up.",
    "What do you call a pile of cats? A meowtain.",
    "Why was the belt arrested? For holding up a pair of pants.",
    "What do you call a boomerang that wont come back? A stick.",
    "Why did the golfer bring two pairs of pants? In case he got a hole in one.",
    "What lies at the bottom of the ocean and twitches? A nervous wreck.",
    "Why don't some couples go to the gym? Because some relationships don't work out.",
    "How do you find Will Smith in the snow? You look for the fresh prints.",
    "I would tell you a joke about an elevator, but its an uplifting experience.",
    "Why did the scarecrow win an award? Because he was outstanding in his field.",
    "I'm reading a book on anti-gravity. It's impossible to put down.",
    "Why did the bicycle fall over? It was two-tired.",
    "What did the janitor say when he jumped out of the closet? Supplies!",
    "I used to play piano by ear, but now I use my hands.",
    "Why was the math book sad? Because it had too many problems.",
    "I'm on a whiskey diet. I've lost three days already.",
    "Why did the picture go to jail? Because it was framed.",
    "I'd tell a chemistry joke but I know I wouldn't get a reaction.",
    "I have a joke about time travel, but you didn't like it.",
    "Parallel lines have so much in common. Its a shame they will never meet.",
    "My wife told me to stop impersonating a flamingo. I had to put my foot down.",
    "I told my wife she was drawing her eyebrows too high. She looked surprised.",
    "I threw a boomerang a few years ago. I now live in constant fear.",
    "Why don't programmers like nature? It has too many bugs.",
    "I'm reading a book about anti-gravity. It's impossible to put down.",
    "Did you hear about the claustrophobic astronaut? He just needed a little space."
  ]
  